app/views/transporter_addresses/_form.html.erb

SELECT "locations".* FROM "locations" WHERE "locations"."deleted_at" IS NULL AND "locations"."location_type" = $1  [["location_type", 1]]
---
              <%= f.label :region_id, 'Region' %>
              <%= f.collection_select :region_id, Location.where(location_type: :region), :id, :name,{include_blank: 'Select region'}, {:class => 'form-control'} %>