app/views/users/_form.html.erb

SELECT "departments".* FROM "departments" WHERE "departments"."deleted_at" IS NULL
---
                            <%= f.label :Department %>
                <%= f.select :department_id,options_for_select(@department, :selected => f.object.department_id, :include_blank => true),{}, {:class => 'form-control'} %>

SELECT "hubs".* FROM "hubs" WHERE "hubs"."deleted_at" IS NULL
---
                            <%= f.label :Hub %>
                <%= f.select :hub_id,options_for_select(@hubs, :selected => f.object.hub_id),{}, {:class => 'form-control'} %>