app/views/users/departments.html.erb

                <td>
                  <%= check_box_tag "departments[#{department.id}]", 1 , @user.departments.include?(department)  %>
---
SELECT  1 AS one FROM "departments" INNER JOIN "users_departments" ON "departments"."id" = "users_departments"."department_id" WHERE "departments"."deleted_at" IS NULL AND "users_departments"."deleted_at" IS NULL AND "users_departments"."user_id" = $1 AND "departments"."id" = $2 LIMIT $3  [["user_id", 21], ["id", 1], ["LIMIT", 1]]
SELECT "departments".* FROM "departments" WHERE "departments"."deleted_at" IS NULL AND 1=0

                <td>
                  <%= check_box_tag "roles[#{role.name}]", 1 , @user.roles.include?(role)  %>
---
SELECT  1 AS one FROM "roles" INNER JOIN "users_roles" ON "roles"."id" = "users_roles"."role_id" WHERE "roles"."deleted_at" IS NULL AND "users_roles"."user_id" = $1 AND "roles"."id" = $2 LIMIT $3  [["user_id", 21], ["id", 76], ["LIMIT", 1]]
SELECT "roles".* FROM "roles" WHERE "roles"."deleted_at" IS NULL