app/views/users/index.html.erb

            <td><%= user.user_types %> </td>
            <td><%= user.roles.map {|r| r.name}.join ', ' %></td>
---
SELECT "roles".* FROM "roles" INNER JOIN "users_roles" ON "roles"."id" = "users_roles"."role_id" WHERE "roles"."deleted_at" IS NULL AND "users_roles"."user_id" = $1 AND (((roles.name = 'admin') AND (roles.resource_type IS NULL) AND (roles.resource_id IS NULL)))  [["user_id", 18]]