app/views/users/roles.html.erb

SELECT  1 AS one FROM "roles" INNER JOIN "users_roles" ON "roles"."id" = "users_roles"."role_id" WHERE "roles"."deleted_at" IS NULL AND "users_roles"."user_id" = $1 AND "roles"."id" = $2 LIMIT $3  [["user_id", 26], ["id", 71], ["LIMIT", 1]]
SELECT "roles".* FROM "roles" WHERE "roles"."deleted_at" IS NULL
---
                <td>
                  <%= check_box_tag "roles[#{role.name}]", 1 , @user.roles.include?(role)  %>