app/views/users/show.html.erb

        <div class="controls col-sm-7">
          <% if !@user.departments.nil?  && !Department.find_by(id: @user.department_id).nil? %>
---
SELECT "departments".* FROM "departments" WHERE "departments"."deleted_at" IS NULL AND "departments"."id" IN (1, 2, 4)

                <% guest_permission = @all_permissions.where(name: permission, user_type: :guest).first %>
                <%= check_box_tag "permissions[#{guest_permission.id}]", 1 , @user.permissions.include?(guest_permission), :disabled => true %>
---
SELECT "permissions".* FROM "permissions" WHERE "permissions"."deleted_at" IS NULL AND 1=0