app/views/users/user_permissions.html.erb

SELECT  1 AS one FROM "permissions" INNER JOIN "users_permissions" ON "permissions"."id" = "users_permissions"."permission_id" WHERE "permissions"."deleted_at" IS NULL AND "users_permissions"."deleted_at" IS NULL AND "users_permissions"."user_id" = $1 AND "permissions"."id" = $2 LIMIT $3  [["user_id", 21], ["id", 1], ["LIMIT", 1]]
SELECT "permissions".* FROM "permissions" WHERE "permissions"."deleted_at" IS NULL
---
                <td>
                  <%= check_box_tag "permissions[#{permission.id}]", 1 , @user.permissions.include?(permission)  %>