app/views/users/user_departments.html.erb

                <td>
                  <%= check_box_tag "departments[#{department.id}]", 1 , @user.departments.include?(department)  %>
---
SELECT  1 AS one FROM "departments" INNER JOIN "users_departments" ON "departments"."id" = "users_departments"."department_id" WHERE "departments"."deleted_at" IS NULL AND "users_departments"."deleted_at" IS NULL AND "users_departments"."user_id" = $1 AND "departments"."id" = $2 LIMIT $3  [["user_id", 21], ["id", 1], ["LIMIT", 1]]
SELECT "departments".* FROM "departments" WHERE "departments"."deleted_at" IS NULL