app/views/users/user_profile.html.erb

SELECT  1 AS one FROM "departments" INNER JOIN "users_departments" ON "departments"."id" = "users_departments"."department_id" WHERE "departments"."deleted_at" IS NULL AND "users_departments"."deleted_at" IS NULL AND "users_departments"."user_id" = $1 AND "departments"."id" = $2 LIMIT $3  [["user_id", 21], ["id", 1], ["LIMIT", 1]]
SELECT "departments".* FROM "departments" WHERE "departments"."deleted_at" IS NULL AND 1=0
---
                <td>
                  <%= check_box_tag "departments[#{department.id}]", 1 , @user.departments.include?(department), disabled: true  %>

SELECT  1 AS one FROM "permissions" INNER JOIN "users_permissions" ON "permissions"."id" = "users_permissions"."permission_id" WHERE "permissions"."deleted_at" IS NULL AND "users_permissions"."deleted_at" IS NULL AND "users_permissions"."user_id" = $1 AND "permissions"."id" = $2 LIMIT $3  [["user_id", 21], ["id", 1], ["LIMIT", 1]]
SELECT "permissions".* FROM "permissions" WHERE "permissions"."deleted_at" IS NULL AND 1=0
---
                <td>
                  <%= check_box_tag "permissions[#{permission.name}]", 1 , @user.permissions.include?(permission), disabled: true %>