app/views/transporters/show.html.erb

            <tbody>
              <% @transporter.transporter_addresses.each do |transporter_address| %>
---
SELECT "transporter_addresses".* FROM "transporter_addresses" WHERE "transporter_addresses"."deleted_at" IS NULL AND "transporter_addresses"."transporter_id" = $1  [["transporter_id", 7]]