app/views/fdp_contacts/_form.html.erb

          <%= f.label :FDP %>
          <%= f.collection_select :fdp_id,
                    Fdp.order(:name),:id,:name,{include_blank: true}, {class:'form-control'}%>
---
SELECT "fdps".* FROM "fdps" WHERE "fdps"."deleted_at" IS NULL ORDER BY "fdps"."name" ASC