app/controllers/currencies_controller.rb

SELECT "currencies".* FROM "currencies" WHERE "currencies"."deleted_at" IS NULL
---
  def index
    @currencies = Currency.all