app/controllers/departments_controller.rb

  def index
    @departments = Department.all
---
SELECT "departments".* FROM "departments" WHERE "departments"."deleted_at" IS NULL

  def create
    @department = Department.new(department_params)
    @department.created_by = current_user.id
---
INSERT INTO "departments" ("name", "description", "created_by", "modified_by", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "new department"], ["description", ""], ["created_by", 18], ["modified_by", 18], ["created_at", 2017-03-22 13:33:54 UTC], ["updated_at", 2017-03-22 13:33:54 UTC]]

  def update
    @department.modified_by = current_user.id
    respond_to do |format|
      if @department.update(department_params)
---
UPDATE "departments" SET "name" = $1, "description" = $2, "modified_by" = $3, "updated_at" = $4 WHERE "departments"."id" = $5  [["name", "Early Warning"], ["description", "EW"], ["modified_by", 21], ["updated_at", 2017-03-27 06:57:12 UTC], ["id", 1]]

  def destroy

    users = UsersDepartment.where(department_id: @department.id)
    user_departments = UsersDepartment.where.not(department_id: @department.id)

     if user_departments.count < 1 then
        users.each do |d|
        UsersPermission.where(user_id: d.user_id).delete_all
        DepartmentPermission.where(department_id: d.department_id).delete_all
         end

    else

      user_departments.each do |d|
        UsersPermission.where(user_id: d.user_id).delete_all
        DepartmentPermission.where(department_id: d.id).delete_all
     end

   user_departments.each do |d|

   departmentPermissions = DepartmentPermission.where(department_id: d.department_id).all
        departmentPermissions.each do |departmentPermission|

         if !UsersPermission.exists? user_id: d.user_id , permission_id: departmentPermission.permission_id then
---
SELECT  "departments".* FROM "departments" WHERE "departments"."deleted_at" IS NULL AND "departments"."id" = $1 LIMIT $2  [["id", 84], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 18], ["LIMIT", 1]]

    def set_department
      @department = Department.find(params[:id])
---
SELECT  "departments".* FROM "departments" WHERE "departments"."deleted_at" IS NULL AND "departments"."id" = $1 LIMIT $2  [["id", 87], ["LIMIT", 1]]