app/controllers/fdp_contacts_controller.rb

  def index
    @fdp_contacts = FdpContact.all
---
SELECT "fdp_contacts".* FROM "fdp_contacts" WHERE "fdp_contacts"."deleted_at" IS NULL

    def set_fdp_contact
      @fdp_contact = FdpContact.find(params[:id])
---
SELECT  "fdp_contacts".* FROM "fdp_contacts" WHERE "fdp_contacts"."deleted_at" IS NULL AND "fdp_contacts"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]