app/controllers/fdps_controller.rb

  def index
    @user = User.find(current_user.id)
    if @user.present? && @user.first_name != 'Administrator'
       fdp_locations = Location.find_by(id: @user.location_id).descendants.where( location_type: :woreda).map { |d| d.id}
      @fdps = Fdp.where( location_id: fdp_locations).all
    else
      @fdps = Fdp.all
---
SELECT  "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 18], ["LIMIT", 1]]
SELECT "fdps".* FROM "fdps" WHERE "fdps"."deleted_at" IS NULL