app/controllers/hubs_controller.rb

  def index
    @hubs = Hub.all
---
SELECT "hubs".* FROM "hubs" WHERE "hubs"."deleted_at" IS NULL