app/controllers/locations_controller.rb

SELECT "locations".* FROM "locations" WHERE "locations"."deleted_at" IS NULL AND "locations"."location_type" = $1  [["location_type", 1]]
SELECT  "locations".* FROM "locations" WHERE "locations"."deleted_at" IS NULL AND "locations"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
  def show
    if params[:id] == '0'
      @locations = Location.where( location_type: :region)

      @listed_locs_type = 'region'
    else
      @parent = Location.find params[:id]

INSERT INTO "locations" ("name", "created_at", "updated_at", "location_type", "created_by", "modified_by") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "b"], ["created_at", 2017-03-23 18:10:12 UTC], ["updated_at", 2017-03-23 18:10:12 UTC], ["location_type", 1], ["created_by", 18], ["modified_by", 18]]
---
  def create

    parent_id = params[:parent_id].to_i

    if params[:name].blank?
      flash[:error] = "The 'name' field is required."

      redirect_to action: :show, id: params[:parent_id]
      return
    end

    begin
      if parent_id == 0
        Location.create!( name: params[:name], location_type: :region )