app/controllers/programs_controller.rb

SELECT "programs".* FROM "programs" WHERE "programs"."deleted_at" IS NULL
---
  def index
    @programs = Program.all