app/controllers/rations_controller.rb

SELECT "rations".* FROM "rations" WHERE "rations"."deleted_at" IS NULL
---
  def index
    @rations = Ration.all

INSERT INTO "rations" ("reference_no", "description", "created_at", "updated_at", "created_by", "modified_by") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["reference_no", "sample ration"], ["description", ""], ["created_at", 2017-03-23 07:52:32 UTC], ["updated_at", 2017-03-23 07:52:32 UTC], ["created_by", 18], ["modified_by", 18]]
---
  def create
    @ration = Ration.new(ration_params)

    respond_to do |format|
      if @ration.save

SELECT  "rations".* FROM "rations" WHERE "rations"."deleted_at" IS NULL AND "rations"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_ration
      @ration = Ration.find(params[:id])