app/controllers/ration_items_controller.rb

  def new
    @ration = Ration.find params[:ration_id]
---
SELECT  "rations".* FROM "rations" WHERE "rations"."deleted_at" IS NULL AND "rations"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def create
    @ration_item = RationItem.new(ration_item_params)
    @ration = Ration.find params[:ration_id]
---
SELECT  "rations".* FROM "rations" WHERE "rations"."deleted_at" IS NULL AND "rations"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]