app/controllers/transporter_addresses_controller.rb

SELECT  "transporters".* FROM "transporters" WHERE "transporters"."deleted_at" IS NULL AND "transporters"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
  def new
    @transporter = Transporter.find(params[:transporter_id])