app/controllers/transporters_controller.rb

SELECT "transporters".* FROM "transporters" WHERE "transporters"."deleted_at" IS NULL
---
  def index
    @transporters = Transporter.all

INSERT INTO "transporters" ("name", "code", "contact", "contact_phone", "remark", "created_at", "updated_at", "created_by", "modified_by") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @transporter = Transporter.new(transporter_params)
    @transporter.created_by = current_user.id

SELECT  "transporters".* FROM "transporters" WHERE "transporters"."deleted_at" IS NULL AND "transporters"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
  def set_transporter
    @transporter = Transporter.find(params[:id])