app/controllers/users_controller.rb

  def show
    @all_departments = Department.where(id: @user.users_departments.pluck(:department_id))
    @all_permissions = Permission.where(id: @user.users_permissions.pluck(:permission_id))
---
SELECT "users_departments"."department_id" FROM "users_departments" WHERE "users_departments"."deleted_at" IS NULL AND "users_departments"."user_id" = $1  [["user_id", 27]]
SELECT "users_permissions"."permission_id" FROM "users_permissions" WHERE "users_permissions"."deleted_at" IS NULL AND "users_permissions"."user_id" = $1  [["user_id", 27]]