app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."deleted_at" IS NULL
---
  def index
    @users = User.all

SELECT  "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 18], ["LIMIT", 1]]
SELECT "permissions".* FROM "permissions" WHERE "permissions"."deleted_at" IS NULL AND 1=0
---
  def show
    @user = User.find(params[:id])
    @all_permissions = Permission.all

SELECT "departments".* FROM "departments" WHERE "departments"."deleted_at" IS NULL
SELECT "locations".* FROM "locations" WHERE "locations"."deleted_at" IS NULL AND "locations"."location_type" = $1  [["location_type", 1]]
SELECT "hubs".* FROM "hubs" WHERE "hubs"."deleted_at" IS NULL
---
  def edit
    @department= Department.all.map{ |h| [h.name, h.id]} # case teams
    @region= Location.where(location_type: 1).map{ |h| [h.name, h.id]}     # regions
    @hubs = Hub.all.map{ |r| [r.name, r.id]}  # hubs

SELECT  "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 18], ["LIMIT", 1]]
SELECT "departments".* FROM "departments" WHERE "departments"."deleted_at" IS NULL
---
  def user_departments
    @user = User.find(params[:user_id])
    @all_departments = Department.all

SELECT  "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 18], ["LIMIT", 1]]
SELECT "permissions".* FROM "permissions" WHERE "permissions"."deleted_at" IS NULL
---
  def user_permissions
    @user = User.find(params[:user_id])
    @all_permissions = Permission.all

SELECT "users_departments".* FROM "users_departments" WHERE "users_departments"."deleted_at" IS NULL AND "users_departments"."user_id" = $1  [["user_id", 21]]
INSERT INTO "users_departments" ("user_id", "department_id", "created_by", "modified_by", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 2], ["department_id", 2], ["created_by", 18], ["modified_by", 18], ["created_at", 2017-03-22 20:43:30 UTC], ["updated_at", 2017-03-22 20:43:30 UTC]]
SELECT "departments".* FROM "departments" INNER JOIN "users_departments" ON "departments"."id" = "users_departments"."department_id" WHERE "departments"."deleted_at" IS NULL AND "users_departments"."deleted_at" IS NULL AND "users_departments"."user_id" = $1  [["user_id", 21]]
---
  def updateDepartments
    new_departments =  params.require(:departments)
    UsersDepartment.where(user_id: @user.id).destroy_all


    new_departments.each do |department|

      dep =  UsersDepartment.new({
                                   department_id:department.to_i,
                                   user_id: @user.id
      })
      dep.modified_by = current_user.id
      dep.save
    end


    user_deparments =  UsersDepartment.where(user_id: @user.id)

    if user_deparments.count>0 then
      UsersPermission.where(user_id: @user.id).destroy_all
    end

    user_deparments.each do |user_department|

        departmentPermissions = DepartmentPermission.where(department_id: user_department.department_id)

SELECT "users_permissions".* FROM "users_permissions" WHERE "users_permissions"."deleted_at" IS NULL AND "users_permissions"."user_id" = $1  [["user_id", 21]]
INSERT INTO "users_permissions" ("user_id", "permission_id", "created_by", "modified_by", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 21], ["permission_id", 1], ["created_by", 18], ["modified_by", 18], ["created_at", 2017-03-25 13:23:26 UTC], ["updated_at", 2017-03-25 13:23:26 UTC]]
---
  def updatePermissions
    puts @user.id

    if(params[:permissions].present?)
      new_permissions = params.require(:permissions)
      UsersPermission.where(user_id: @user.id).destroy_all

      new_permissions.each do |permission|
        _permission = UsersPermission.new ({
                                            permission_id: permission.to_i,
                                            user_id: @user.id
        })
        _permission.modified_by = current_user.id
        _permission.save

SELECT "roles".* FROM "roles" WHERE "roles"."deleted_at" IS NULL
---
  def roles
    @all_roles = Role.all

UPDATE "users" SET "hub_id" = $1, "location_id" = $2, "mobile_no" = $3, "department_id" = $4, "updated_at" = $5 WHERE "users"."id" = $6  [["hub_id", 1], ["location_id", 4], ["mobile_no", "0912615598"], ["department_id", 1], ["updated_at", 2017-03-29 08:40:19 UTC], ["id", 27]]
---
  def update
    @user.modified_by = current_user.id
    respond_to do |format|
      if @user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 21], ["LIMIT", 1]]
---
  def set_user
    @user = User.find(params[:id])