app/controllers/users_controller.rb

SELECT "users_departments"."department_id" FROM "users_departments" WHERE "users_departments"."deleted_at" IS NULL AND "users_departments"."user_id" = $1  [["user_id", 26]]
SELECT "roles".* FROM "roles" WHERE "roles"."deleted_at" IS NULL
---
  def departments
    @all_departments = Department.where(id: @user.users_departments.pluck(:department_id))
    @all_roles = Role.all