app/views/rations/_ration_view.html.erb


          <% if @ration.ration_items.count == 0 %>
---
SELECT COUNT(*) FROM "ration_items" WHERE "ration_items"."deleted_at" IS NULL AND "ration_items"."ration_id" = $1  [["ration_id", 2]]