app/views/ration_items/_form.html.erb

            <div class="col-sm-6">
              <%= f.collection_select :commodity_id, Commodity.order(:name), :id, :name,{include_blank: 'Select Commodity'}, {:class => 'form-control'} %>
---
SELECT "commodities".* FROM "commodities" WHERE "commodities"."deleted_at" IS NULL ORDER BY "commodities"."name" ASC

            <div class="col-sm-6">
              <%= f.collection_select :unit_of_measure_id, UnitOfMeasure.order(:name), :id, :name,{include_blank: 'Select Unit of Measure'}, {:class => 'form-control'} %>
---
SELECT "unit_of_measures".* FROM "unit_of_measures" WHERE "unit_of_measures"."deleted_at" IS NULL ORDER BY "unit_of_measures"."name" ASC